# Wrangling
often used anonymously to Explorative Data Analysis (EDA)
--> making the data model work

<ul>
<li><a href="#gather">Gather</a></li>
- collect (acquisition)
- understand

- e.g.
    - download
    - get from API
    - scrap it from a web page
    - from a database


<li><a href="#access">Access</a></li>
- inspect data
<li><a href="#clean">Clean</a></li>

- incorrect data types

- missing data

- duplicates

- structural problems

</ul>

<a id='gather'></a>
## Gather

### Reading CSV files

In [3]:
import pandas as pd

df = pd.read_csv('city_list.csv')
df.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

In [4]:
df2 = pd.read_csv('city_list.csv', sep=':')
df2.head()

                     city,country
0           Abidjan,Côte D'Ivoire
1  Abu Dhabi,United Arab Emirates
2                   Abuja,Nigeria
3                     Accra,Ghana
4                    Adana,Turkey

In [5]:
df = pd.read_csv('city_list.csv', header=2)
df.head()

  Abu Dhabi United Arab Emirates
0     Abuja              Nigeria
1     Accra                Ghana
2     Adana               Turkey
3  Adelaide            Australia
4      Agra                India

In [6]:
df = pd.read_csv('city_list.csv', header=None)
df.head()

           0                     1
0       city               country
1    Abidjan         Côte D'Ivoire
2  Abu Dhabi  United Arab Emirates
3      Abuja               Nigeria
4      Accra                 Ghana

In [7]:
labels = ['CITY', 'COUNTRY']
df = pd.read_csv('city_list.csv', names=labels)
df.head()

        CITY               COUNTRY
0       city               country
1    Abidjan         Côte D'Ivoire
2  Abu Dhabi  United Arab Emirates
3      Abuja               Nigeria
4      Accra                 Ghana

In [8]:
labels = ['CITY', 'COUNTRY']
df = pd.read_csv('city_list.csv', header=0, names=labels)
df.head()

        CITY               COUNTRY
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

#### Index
Instead of using the default index (integers incrementing by 1 from 0), you can specify one or more of your columns to be the index of your dataframe.

In [9]:
df = pd.read_csv('city_list.csv', index_col=['city', 'country'])
df.head()

Empty DataFrame
Columns: []
Index: [(Abidjan, Côte D'Ivoire), (Abu Dhabi, United Arab Emirates), (Abuja, Nigeria), (Accra, Ghana), (Adana, Turkey)]

In [10]:
df = pd.read_csv('city_list.csv', index_col='city')
df.head()

                        country
city
Abidjan           Côte D'Ivoire
Abu Dhabi  United Arab Emirates
Abuja                   Nigeria
Accra                     Ghana
Adana                    Turkey

### Writing CSV files

In [11]:
df.to_csv('city_list_edited.csv')

In [12]:
df_fistAttempt = pd.read_csv('city_list_edited.csv')
df_fistAttempt.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

In [13]:
df.to_csv('city_list_edited.csv', index=False)

In [14]:
df = pd.read_csv('city_list_edited.csv')
df.head()

                country
0         Côte D'Ivoire
1  United Arab Emirates
2               Nigeria
3                 Ghana
4                Turkey

<a id='access'></a>
## Access

In [15]:
# this returns a tuple of the dimensions of the dataframe
df = pd.read_csv('city_list.csv')
df.shape

(345, 2)

In [16]:
# this returns the datatypes of the columns
df.dtypes

city       object
country    object
dtype: object

In [17]:
# although the datatype for diagnosis appears to be object, further
# investigation shows it's a string
type(df['city'][0])

str

Pandas actually stores [pointers](https://en.wikipedia.org/wiki/Pointer_(computer_programming)) to strings in dataframes and series, which is why `object` instead of `str` appears as the datatype. Understanding this is not essential for data analysis - just know that strings will appear as objects in Pandas.

In [18]:
# this displays a concise summary of the dataframe,
# including the number of non-null values in each column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 345 entries, 0 to 344
Data columns (total 2 columns):
city       345 non-null object
country    345 non-null object
dtypes: object(2)
memory usage: 5.5+ KB

In [19]:
# this returns the number of unique values in each column
df.nunique()

city       332
country    137
dtype: int64

In [20]:
# this returns useful descriptive statistics for each column of data
df.describe()

            city        country
count        345            345
unique       332            137
top     Santiago  United States
freq           3             52

In [21]:
df.mean()

Series([], dtype: float64)

In [22]:
# this returns the first few lines in our dataframe
# by default, it returns the first five
df.head(2)

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates

In [23]:
# same thing applies to `.tail()` which returns the last few rows
df.tail(2)

        city  country
343   Zagreb  Croatia
344  Zapopan   Mexico

### Indexing and Selecting Data in Pandas
Let's separate this dataframe into three new dataframes - one for each metric (mean, standard error, and maximum). To get the data for each dataframe, we need to select the `id` and `diagnosis` columns, as well as the ten columns for that metric.

In [24]:
# View the index number and label for each column
for i, v in enumerate(df.columns):
    print(i, v)

0 city
1 country

We can select data using `loc` and `iloc`, which you can read more about [here](https://pandas.pydata.org/pandas-docs/stable/indexing.html). `loc` uses labels of rows or columns to select data, while `iloc` uses the index numbers. We'll use these to index the dataframe below.

In [25]:
# select all the columns from 'id' to the last mean column
df_means = df.loc[:, 'city':'country']
df_means.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

In [26]:
df_means = df.iloc[:,:11]
df_means.head()

        city               country
0    Abidjan         Côte D'Ivoire
1  Abu Dhabi  United Arab Emirates
2      Abuja               Nigeria
3      Accra                 Ghana
4      Adana                Turkey

### Selecting Multiple Ranges in Pandas
Selecting the columns for the mean dataframe was pretty straightforward - the columns we needed to select were all together (`id`, `diagnosis`, and the mean columns). Now we run into a little issue when we try to do the same for the standard errors or maximum values. `id` and `diagnosis` are separated from the rest of the columns we need! We can't specify all of these in one range.

First, try creating the standard error dataframe on your own to see why doing this with just `loc` and `iloc` is an issue. Then, use this [stackoverflow link](https://stackoverflow.com/questions/41256648/select-multiple-ranges-of-columns-in-pandas-dataframe) to learn how to select multiple ranges in Pandas and try it below. By the way, to figure this out myself, I just found this link by googling "how to select multiple ranges df.iloc"

*Hint: You may have to import a new package!*

In [27]:
# import
#import numpy as np

# create the standard errors dataframe
#df_std = df.iloc[:, np.r_[:, 0:1, 12:22]]

<a id='clean'></a>
## Clean

### Missing Data

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 345 entries, 0 to 344
Data columns (total 2 columns):
city       345 non-null object
country    345 non-null object
dtypes: object(2)
memory usage: 5.5+ KB

In [ ]:
# filling the NaN values
mean = df['view_duration'].mean()
df['view_duration'] = df['view_duration'].fillna(mean)
#or
df['view_duration'].fillna(mean, inplace=True)

### Duplicates

In [32]:
# count the duplicates
sum(df.duplicated())

0

In [ ]:
# drop duplicates
df.drop_duplicates(inplace=True)

### Incorrect Data Types

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 345 entries, 0 to 344
Data columns (total 2 columns):
city       345 non-null object
country    345 non-null object
dtypes: object(2)
memory usage: 5.5+ KB

In [34]:
# convert string to time stamp
df['timestamp'] = pd.to_datetime(df['timestamp'])

# if saving to csv file, strings are still used. You need to convert again or use parameter parsedates when saving to csv file.

### Renaming Columns

In [ ]:
# remove "_mean" from column names
new_labels = []
for col in df.columns:
    if '_mean' in col:
        new_labels.append(col[:-5])  # exclude last 5 characters
    else:
        new_labels.append(col)

# assign new labels to columns in dataframe
df.columns = new_labels

# new labels for our columns
new_labels

In [ ]:
# renaming column name
red_df = red_df.rename(columns = {'total_sulfur-dioxide':'total_sulfur_dioxide'})